recnik = {
    'а' : 'a',
    'б' : 'b',
    'в' : 'v',
    'г' : 'g',
    'д' : 'd',
    'ђ' : 'dj',
    'е' : 'e',
    'ж' : 'ž',
    'з' : 'z',
    'и' : 'i',
    'ј' : 'j',
    'к' : 'k',
    'л' : 'l',
    'љ' : 'lj',
    'м' : 'm',
    'н' : 'n',
    'њ' : 'nj',
    'о' : 'o',
    'п' : 'p',
    'р' : 'r',
    'с' : 's',
    'т' : 't',
    'ћ' : 'ć',
    'у' : 'u',
    'ф' : 'f',
    'х' : 'h',
    'ц' : 'c',
    'ч' : 'č',
    'џ' : 'dz',
    'ш' : 'š',
    'А' : 'A',
    'Б' : 'B',
    'В' : 'V',
    'Г' : 'G',
    'Д' : 'D',
    'Ђ' : 'Đ',
    'Е' : 'E',
    'Ж' : 'Ž',
    'З' : 'Z',
    'И' : 'I',
    'Ј' : 'J',
    'К' : 'K',
    'Л' : 'L',
    'Љ' : 'LJ',
    'М' : 'M',
    'Н' : 'N',
    'Њ' : 'NJ',
    'О' : 'O',
    'П' : 'P',
    'Р' : 'R',
    'С' : 'S',
    'Т' : 'T',
    'Ћ' : 'Ć',
    'У' : 'U',
    'Ф' : 'F',
    'Х' : 'H',
    'Ц' : 'C',
    'Ч' : 'Č',
    'Џ' : 'DŽ',
    'Ш' : 'Š',
    ' ' : ' ',
    '.' : '.',
    '!' : '!',
    '?' : '?',
    ',' : ','


}


ulazna_rec = input('Upisite rec koju zelite da prebacite na latinicno pismo:')

izlazna_rec = ''

for i in ulazna_rec:
    for j in recnik.keys():
        if i == j:
            izlazna_rec+=recnik[j] 
            break 

print(izlazna_rec)  